src/cf/src/InformationRegisters/ОписаниеИзмененийКонфигурации/ОписаниеИзмененийКонфигурации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОписаниеИзмененийКонфигурации</name>
  <resources>
    <name>ДатаДобавления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОписаниеИзменения</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ТипИзменения</name>
    <type>
      <types>EnumRef.ТипИзмененияОбъекта</types>
    </type>
  </resources>
  <attributes>
    <name>Основание</name>
    <type>
      <types>TaskRef.ЗадачиПользователя</types>
    </type>
  </attributes>
  <dimensions>
    <name>Конфигурация</name>
    <type>
      <types>CatalogRef.Конфигурации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВерсияКонфигурации</name>
    <type>
      <types>CatalogRef.ВерсииКонфигураций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РазделОбновления</name>
    <type>
      <types>CatalogRef.РазделыОбновленийКонфигураций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПорядковыйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/InformationRegisters/ОписаниеИзмененийКонфигурации/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ТекстИзменениеКонфигурации = "Изменение от " + Формат(Запись.ДатаДобавления, "ДФ=dd.MM.yyyy") + " к версии " + Запись.ВерсияКонфигурации; 
	
	Оповестить("Запись_ОписаниеИзмененийКонфигурации", ТекстИзменениеКонфигурации);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВерсияКонфигурацииПриИзменении(Элемент)
	
	Запись.ПорядковыйНомер = ПолучитьМаксимальныйПорядковыйНомерСервер(Запись.Конфигурация, Запись.ВерсияКонфигурации, Запись.РазделОбновления) + 1; 
	
КонецПроцедуры

&НаКлиенте
Процедура РазделОбновленияПриИзменении(Элемент)
	
	Запись.ПорядковыйНомер = ПолучитьМаксимальныйПорядковыйНомерСервер(Запись.Конфигурация, Запись.ВерсияКонфигурации, Запись.РазделОбновления) + 1; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьМаксимальныйПорядковыйНомерСервер(Конфигурация, ВерсияКонфигурации, РазделОбновления)

	Возврат РегистрыСведений.ОписаниеИзмененийКонфигурации.ПолучитьМаксимальныйПорядковыйНомер(Конфигурация, ВерсияКонфигурации, РазделОбновления);	

КонецФункции // ПолучитьМаксимальныйПорядковыйНомерСервер()

#КонецОбласти
